sometext = ("Млечний Шлях це спіральна галактика, яку ми називаємо домом. Її масштаб вражає: "
            "вона містить понад 200 мільярдів зірок і простягається на понад 100 тисяч світлових років. "
            "Земля розташована в одному з рукавів галактики, що дозволяє нам досліджувати її структуру та таємниці.")

# Яковенко Максим особистість номер 1: використання вбудованих функцій як len() lower() upper() split()
print (len(sometext)) #виводить довжину рядка
print (sometext.lower()) #верхній регістр
print (sometext.upper()) #нижній регістр
listik = sometext.split(",")  #разделятор
print (listik) #виводятор
#наступному студенту, використовуй ті функції до яких тебе спрямовує серце

print (" ")

# Яковенко Максим особистість номер 2: використання вбудованих функцій як join() replace() strip()
#дякую за таку можливість я використовуватиму ті функції до яких мене веде серце, наступному студенту передаю таку саму можливість
print (", ".join(listik)) #з'єднятор
print(sometext.replace('.', 'krapka')) #замінює старе на нове
print(sometext.strip()) #прибирає зайве на початку та наприкінці рядка

print (" ")

# Яковенко Максим особистість номер 3: використання вбудованих функцій як count() find() customka()
#дякую за таку можливість на честь вашої доброти я зроблю свою функцію
print(sometext.count('о')) #рахуе кількість елементів
print(sometext.find('200')) #шукае де цей ел
def customka(text):
    c = 0
    l = []
    for el in text:
        if c == 0:
            l.append(el.lower())
            c = 1
        else:
            l.append(el.upper())
            c = 0

    return ''.join(l)

print (customka(sometext)) #гірки верх вниз



